#include "pid.h"

PIDTypedef AltitudeUpPid = 
{
	7.5f,       	//比例系数
    0.6f,       	//积分时间
    90.0f,       	//微分时间
    
    0.0f,  			//期望值
    0.0f,  			//当前值
    
    0.0f,     		//微分
    
    0.0f,     		//积分
    20000.0f,		//积分正限幅
    -20000.0f,			//积分负限幅
    
    14.0f,			//偏差过大 无积分时的Kp 
    
    0.0f,      		//本次偏差
    30.0f, 			//积分分离阈值
    0.5f,			//积分分离时的积分系数 ，如果是0则完全不积分 
	 
    0.0f,  			//上次偏差
    
    0.0f, 		    //输出值
    1000.0f, 		//输出正限幅
    0.0f			//输出负限幅 
};

PIDTypedef SinUpCtrlPid = 
{
	7.5f,       	//比例系数
    0.55f,       	//积分时间
    95.0f,       	//微分时间
    
    0.0f,  			//期望值
    0.0f,  			//当前值
    
    0.0f,     		//微分
    
    0.0f,     		//积分
    20000.0f,		//积分正限幅
    -20000.0f,			//积分负限幅
    
    10.0f,			//偏差过大 无积分时的Kp 
    
    0.0f,      		//本次偏差
    8.0f, 			//积分分离阈值
    0.5f,			//积分分离时的积分系数 ，如果是0则完全不积分 
	 
    0.0f,  			//上次偏差
    
    0.0f, 		    //输出值
    1000.0f, 		//输出正限幅
    0.0f			//输出负限幅 
};


